{
  "brand": "COLONY",
  "navigation": ["HOME", "MISSIONS", "DATABASE", "SETTINGS"],
  "views": {
    "HOME": {
      "heading": "Welcome, Pioneer",
      "paragraphs": [
        "Monitor the pulse of your ecosystem, from orbital relays to subterranean labs.",
        "Deploy new modules, triage anomalies, and keep the signal flowing across every colony node.",
        "Your dashboard updates live as each subsystem reports in."
      ],
      "primaryActionLabel": "Launch Hub",
      "statusMessage": "Initiating Colony hub bootstrap... telemetry link pending."
    },
    "MISSIONS": {
      "heading": "Mission Control",
      "paragraphs": [
        "Curate expeditions for survey crews and autonomous drones.",
        "Review intel, assign specialists, and sync their loadouts before departure.",
        "Adaptive routing keeps teams supplied as they cross hostile biomes."
      ],
      "primaryActionLabel": "Queue Mission",
      "statusMessage": "Next mission packet staged for uplink. Awaiting confirmation."
    },
    "DATABASE": {
      "heading": "Knowledge Vault",
      "paragraphs": [
        "Archive genomes, trade manifests, and decoded beacon reports.",
        "Link fragments together to map trade routes and culture exchanges.",
        "Pattern matching surfaces anomalies before they reach the frontier."
      ],
      "primaryActionLabel": "Index Artifact",
      "statusMessage": "Archival node reserved. Begin artifact ingestion sequence."
    },
    "SETTINGS": {
      "heading": "Systems Configuration",
      "paragraphs": [
        "Tune failover thresholds, diagnostics cadence, and access protocols.",
        "Harden comms relays, rotate keys, and route maintenance drones proactively.",
        "Export hardened configs to staging before syncing the fleet.",
        "Baseline utilities cover the essentials so every operator can tailor their cockpit without diving into custom scripts.",
        "Configuration changes snapshot automatically with rollback points, making it safe to explore more aggressive profiles."
      ],
      "primaryActionLabel": "Deploy Update",
      "statusMessage": "Configuration diff compiled. Ready for distributed rollout.",
      "sections": [
        {
          "title": "General",
          "options": [
            "Profile identity, avatar rotation, and contact channels",
            "Language, locale formatting, and measurement units",
            "Startup behavior, workspace restore, and autosave cadence"
          ]
        },
        {
          "title": "Display",
          "options": [
            "Theme selection: Light, Dark, or follow system",
            "Font scale, UI density, and high-contrast overlays",
            "Windowing defaults including fullscreen, snapping, and multi-monitor focus"
          ]
        },
        {
          "title": "Audio",
          "options": [
            "Master mix, alert channel trims, and mute schedules",
            "Spatialization toggles for multi-speaker rigs",
            "Voice comms devices, push-to-talk, and noise suppression"
          ]
        },
        {
          "title": "Network",
          "options": [
            "Preferred uplink routes and offline cache horizon",
            "Proxy credentials, trusted relays, and quarantine zones",
            "Telemetry sampling rate, bandwidth caps, and sync windows"
          ]
        },
        {
          "title": "Security",
          "options": [
            "Multi-factor policy, session timeout, and device trust",
            "Encryption suites, key rotation frequency, and audit trails",
            "Incident response contacts and escalation automation"
          ]
        },
        {
          "title": "Accessibility",
          "options": [
            "Screen reader hints, captions, and descriptive telemetry",
            "Input remapping, sticky controls, and dwell interactions",
            "Colorblind palettes, motion reduction, and haptic feedback tuning"
          ]
        },
        {
          "title": "Shortcuts & Automation",
          "options": [
            "Keyboard layers, macro sequencing, and command palettes",
            "Scheduler windows for routine diagnostics and deployments",
            "Webhooks, API tokens, and sandboxed scripting runtimes"
          ]
        }
      ]
    }
  }
}
